<?php
// 
// **************************************************
// **************************************************
// ■ サイト全体に渡るデバッグ関連機能に関する設定
// 
//  １．【GB_DEBUG_DEFINE】デバッグ機能フラグ
//    TRUE ：デバッグ機能有り
//    FALSE：デバッグ機能無し
// 
//    ※ 現時点では未使用
// 
//  ２．【GB_MOBILE_DEFINE】モバイル環境固定フラグ
//    TRUE ：「モバイル環境固定」定義
//    FALSE：「デバイスタイプ対応」定義
// 
//  ３．【GB_PALLAX_DEFINE】PALLAX効果、停止フラグ
//    TRUE ：Pallax効果有り
//    FALSE：Pallax効果無し
// 
// **************************************************
// **************************************************
function debugDefine() {
    $params = [

      // **************************************
      //   １．TRUE ：「モバイル環境固定」定義
      //   ２．FALSE：「デバイスタイプ対応」定義
      // **************************************
      'GB_MOBILE_DEFINE' => false,
      // 'GB_MOBILE_DEFINE' => true,

      // **************************************
      //    TRUE ：Pallax効果有り
      //    FALSE：Pallax効果無し
      // **************************************
      'GB_PALLAX_DEFINE' => true,
      // 'GB_PALLAX_DEFINE' => false,
      
      // 
      // **************************************
      //    TRUE ：デバッグ機能有り
      //    FALSE：デバッグ機能無し
      // ※ 現状は未使用
      // **************************************
      'GB_DEBUG_DEFINE'  => false

    ];
    return $params;
  }
?>